/* No comment provided by engineer. */
"Authenticating as {0}" = "ตรวจสอบสิทธิ์เป็น {0}";
"Calculate checksum for {0}" = "Calculate checksum for {0}";

"Deleting {0}" = "กำลังลบ {0}";
"Disconnected" = "ยกเลิกการเชื่อมต่อแล้ว";
"Disconnecting {0}" = "กำลังยกเลิกการเชื่อมต่อ {0}";
"Downloading {0}" = "กำลังดาวโหลด {0}";
/* Connection type opened */
"{0} connection opened" = "การเชื่อมต่อ {0} ถูกเปิด";

/* Reading size of file. */
"Getting size of {0}" = "หาขนาดของ {0}";

/* Reading modification date of file. */
"Getting timestamp of {0}" = "หาการลงเวลาของ {0}";

/* Reading permission of file. */
"Getting permission of {0}" = "Getting permission of {0}";

/* No activity */
"Idle" = "ยังไม่ทำงาน";
"Listing directory {0}" = "เรียกรายการไดเร็กทอรี่ {0}";
"Making directory {0}" = "สร้างไดเร็กทอรี่ {0}";
"Maximum allowed connections exceeded. Waiting" = "จำนวนการเชื่อมต่อเกินค่าสูงสุด กรุณารอ…";
"Mounting {0}" = "กำลังเชื่อมต่อ {0}";

/* The user did not accept the certificate or is not valid */
"No trusted certificate found" = "ไม่พบใบรับรองความน่าเชื่อถือ";
"Opening {0} connection to {1}" = "กำลังเปิดการเชื่อมต่อ {0} ไปยัง {1}";
"SFTP subsystem ready" = "ระบบย่อย SFTP พร้อม";
"SCP subsystem ready" = "SCP subsystem ready";
"Starting SFTP subsystem" = "ระบบย่อย SFTP เริ่มทำงาน";
"Starting SCP subsystem" = "Starting SCP subsystem";
"Uploading {0}" = "กำลังอัพโหลด {0}";

/* Renaming file status message; Renaming to <new filename>. */
"Renaming {0} to {1}" = "Renaming {0} to {1}";

/* Duplicate a file */
"Copying {0} to {1}" = "Copying {0} to {1}";

/* Changing the owner of a file */
"Changing owner of {0} to {1}" = "Changing owner of {0} to {1}";

/* Changing the group owner of a file */
"Changing group of {0} to {1}" = "Changing group of {0} to {1}";

/* Changing UNIX file permissions */
"Changing permission of {0} to {1}" = "Changing permission of {0} to {1}";

/* Indicates remaining time needed for files to transfer */
"{0} seconds remaining" = "{0} seconds remaining";

/* Indicates remaining time needed for files to transfer */
"{0} minutes remaining" = "{0} minutes remaining";

/* Indicates remaining time needed for files to transfer */
"{0} hours remaining" = "{0} hours remaining";

/* When trying to determine the IP address of a server hostname; e.g. Resolving example.net */
"Resolving {0}" = "Resolving {0}";

/* Retry in 10 seconds - Used to indicate the time left until another connection attempt is made */
"Retry again in {0} seconds ({1} more attempts)" = "Retry again in {0} seconds ({1} more attempts)";
"Transfer complete" = "Transfer complete";
"Transfer incomplete" = "Transfer incomplete";

/* Content distribution network (CDN) */
"Enable {0} Distribution" = "Enable {0} Distribution";
"Disable {0} Distribution" = "Disable {0} Distribution";

/* Compress and expand archives */
"Archiving {0}" = "Archiving {0}";
"Unarchiving {0}" = "Unarchiving {0}";

/* Compute MD5 hash */
"Compute MD5 hash of {0}" = "Compute MD5 hash of {0}";

/* Reading HTTP headers */
"Reading metadata of {0}" = "Reading metadata of {0}";

/* Writing custom HTTP headers */
"Writing metadata of {0}" = "Writing metadata of {0}";

/* Prepare path for transfer */
"Prepare {0} ({1})" = "Prepare {0} ({1})";

/* Content distribution network (CDN) configuration */
"Reading CDN configuration of {0}" = "Reading CDN configuration of {0}";
"Writing CDN configuration of {0}" = "Writing CDN configuration of {0}";

/* Growl Notification */
"Connection failed" = "การเชื่อมต่อล้มเหลว";

/* Growl Notification */
"Connection opened" = "การเชื่อมต่อถูกเปิด";

/* Growl Notification */
"Download complete" = "ดาวโหลดสมบูรณ์";

/* Growl Notification */
"Synchronization complete" = "การซิงโครไนซ์สมบูรณ์";

/* Growl Notification */
"Upload complete" = "อัพโหลดสมบูรณ์";

/* Growl Notification */
"Download failed" = "Download failed";

/* Growl Notification */
"Upload failed" = "Upload failed";

/* Growl Notification */
"Transfer queued" = "Transfer queued";
